Autodesk.Revit.DB.HiddenLineViewsType
An enumerated type listing all Hidden Line Views types of Print Setting.

Autodesk.Revit.DB.HiddenLineViewsType.RasterProcessing
The type of Hidden Line Views is Raster Processing.

Autodesk.Revit.DB.HiddenLineViewsType.VectorProcessing
The type of Hidden Line Views is Vector Processing (fast).